# CurtainGridn2 Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId..::..CurtainGridn2 Property
GroupTypeId Class See Also
---
"Grid 2"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurtainGridn2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtainGridn2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurtainGridn2 {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace